{"text":" That short. Like long introductions are no good. Sam knows. All right. Ready everybody? I'm not gonna ask if the mic is working like in every talk so far. I'll just assume it's working. I'm just, no, fuck. All right, well make it work, somebody. >> It works, it works. >> All >> Alright, alright. This is like some kind of class tradition. Alright, alright. I wrote out my talk and afterwards in a couple days I will like turn it from a talk into an essay and put it online so you don't have to take notes, just listen. Alright, so one of the advantages of having kids is that when you have to give advice to people, you can ask yourself, what would I tell my own kids? And actually, you find this really focuses you. So even though my kids are little, my two year old today, when asked what he was gonna be after two, he said a bat. The correct answer was three, but a bat is so much more interesting. So even though my kids are little, I already know what I would tell them about startups if they were in college. And so that is what I'm going to tell you. So you're literally getting what I would give my own kids, since most of you are young enough to be my own kids. Alright, so startups are very counterintuitive. And I'm not sure exactly why. It could be simply because knowledge about is to you you you get new habits, but in the beginning there's this list of things you're trying to remember as you start down the hill. Like alternate feet, make s turns, do not drag the inside foot, all this stuff. Well, startups are as unnatural as skiing, and there is a similar list of stuff you have to remember for startups. And what I'm going to give you today is the beginning of the list. The list of the counterintuitive stuff you have to remember to like prevent your existing instincts from leading you astray. The first thing on it is the fact I just mentioned that startups are so weird that if you follow your instincts they will lead you astray. If you remember nothing more than that when you're about to make a mistake, you may at least pause before making it. When I was running Y Combinator, we used to joke that our function was to tell founders things they would ignore. And it's really true. Batch after batch, the YC partners warn founders about mistakes they are about to make, and the founders ignore them. And they come back a year later and say, I wish we'd listened. But that dude is in their cap table, there's nothing they can do.... They seem wrong. So, of course, your first impulse is to ignore them. And in fact, that is not just the curse of Y Combinator, but to some extent, our raison d'etre. You don't need people to give you advice that doesn't surprise you, right? If founders' existing intuitions gave them the right answers, they wouldn't need us. That's why there are a lot of ski instructors and not many running instructors, right? Like that, you don't see those two words together, running instructors, as much as you see ski instructors. >> >> s s # #. Um, just wait till your interests are opposed and then you'll see. Alright, um, the second counterintuitive point is that, uh, and this will, might come as a little bit of a disappointment, um, but what you need to succeed in a startup is not expertise in startups. That makes this class different from most other classes you take. You take a French class, at the end of it, you will learn how to speak French if you do the work. You may not sound exactly like a French person, the the is you need is expertise in your own users. Mark Zuckerberg did not succeed in Facebook because he was an expert in startups. He succeeded despite being a complete noob at startups. I mean, Facebook was first incorporated as a Florida LLC. Even you guys know better than that. He succeeded despite being a complete noob at startups because he understood his users very well. Most of you don't know the mechanics of raising an angel round, right? And if you feel bad about that, don't, because I can tell you Mark Zuckerberg probably doesn't know the mechanics of raising an angel round either. If he was even paying attention when Ron Conway wrote him the big check, he has probably forgotten about it by now. In fact, I worry it's not merely unnecessary for people to learn in detail about the mechanics of starting a startup, but possibly somewhat dangerous. Because another of the characteristic mistakes of young founders starting startups is to go through the motions of starting a startup. is a. And then the next step after rent a nice office in Soma and hire a bunch of their friends is gradually realize how completely fucked they are because while imitating all the outward forms of starting a startup, they have neglected the one thing that's actually essential which is to make something people want. By the way, that's the only use of that swear word except for the initial one that was involuntary. And I did check with Sam whether it would be okay. 1 1 We saw this happen so often, no, I mean people going through the motions of starting a startup, that we made up a name for it, playing house. Eventually I realized why it was happening. The reason young founders go through the motions of starting a startup is because that is what they have been trained to do for their whole lives up to this point. Think about what t t is is the the to the. That right, essentially. It works in a lot of classes, especially CS classes. I remember automata theory. There's only a few things that make sense to ask about automata theory. So, it's not surprising that after being effectively trained for their whole lives to play such games, young founders first impulse on starting a startup is to figure out what the tricks are for this new game. What are the extracurricular activities of startups? What are the things I have to do? They always want to know... the the. So this is the third thing, the third counterintuitive thing to remember about startups. Starting a startup is where gaming the the f f 1 1. is a the game the system is not how you win. I would have been really excited in college if I had explicitly realized that there are parts of the world where gaming the system matters less than others and some where it hardly matters at all. But there are, and this is one of the most important things to think about when you're planning your future. Got that? Okay. How do you win at each type of the work and what do you want to win by doing? So that brings us to our fourth counterintuitive point. Startups are all consuming. If you start a startup, it will take over your life to a degree that you cannot imagine. And if it succeeds, it will take over your life for a long time. For several years at the very least, maybe a decade, maybe the rest. 3 3 the the. A whole backlog of shit accumulates. And he has to bear this uncomplainingly because number one, as the company's daddy, he can never show fear or weakness. And number two, if you're a billionaire, you get zero, actually less than zero sympathy, if you complain about having a difficult life. >> [LAUGH] >> Which has this strange side effect that the difficulty of being a successful startup founder is concealed from almost everyone who has done it. People who win the 100 meters in the Olympics, like they walk up to them and they're going like, \"Uh, uh, uh, uh.\" Right? Like Larry Page is doing that too, but you never get to see it. Alright, where are we? Y Combinator has now funded several companies that could be called big successes. And in every single case, the founders say the same thing. It never gets any easier. The nature of the problems change. So you may be, you may be worrying about more glamorous problems like construction delays in your new London offices rather than the broken air conditioner in your studio apartment. But the total volume of worry never decreases. If anything, it increases. Starting a successful start, >> >> the the best thing in the world having kids. If you take away one thing from this lecture, remember that. There are a lot of things that are easier to do after you, before you have kids than after. Many of which will make you a better parent when you do have kids, and so in rich countries, most people delay pushing the button for a while. And I'm sure you are all intimately familiar with that procedure. >> >> you about startups, but this is not what you need to know. Essentially, if you want to learn French, universities can teach you linguistics. That's what this is. This is a linguistics class, right? We're teaching you about how to learn languages and what you need to know is how to learn a particular language. What you need to know are the needs of your own users. You can't learn those until you actually start the company. And starting a company, which means that starting a startup is something that you can intrinsically only learn by doing it. And you can't do that in college for the reason I just explained that startups take over your entire life. If you start a startup in college, if you start up a startup as a student, you can't start a startup as a student because if you start a startup, you're not a student anymore. You may be nominally a student but you won't even be that for much longer. So, given this dichotomy, >> >>. Do not start a startup in college. I hope I'm not disappointing anyone. Seriously, honestly. Starting a startup could be a component of a good life for a lot of ambitious people. But this is just part of a much bigger problem that you're trying to solve. How to have a good life, right? And those starting a startup could be a good thing to do at some point. 20 is not the optimal time to do it. There are things that you can't, there are things and the # #. Yes.. Thailand, if that's still what people do. Do people still backpack around Thailand? Okay. Well, that's the first real sign of enthusiasm I've seen from this audience. Should have given this talk in Thailand. All right. He can do things that you can't do, like charter jets to fly him to foreign countries, really big jets. But success has taken a lot of the serendipity out of his life. He, Facebook is running him as much as he's running Facebook. And while it can be really cool to be in the grip of some project you consider your life's work, there are advantages to serendipity. And among other things, it gives you more options to choose your life's work from. There's not even a trade off here. You're not sacrificing anything if you forgo starting a startup at 20, because you'll be more likely to succeed if you wait. In the unlikely case that you're 20, like astronomically unlikely case, that you're 20 and you have some side project that takes off like Facebook did, then you do it at any age, I realize I've made starting a startup sound kind of hard. If I haven't, let me try again. Starting a startup is really hard. What if it's too hard? What if you're not up to this challenge? The answer is the fifth counterintuitive point. You can't tell. Your life so far has given you some idea what your prospects might be if you wanted to become a mathematician or a professional football player. Boy, it's not every audience you could say that to. But unless you have had a very strange life indeed, you have not done much that's like starting a startup. Meaning starting a startup will change you a lot if it works out. So what you're trying to estimate is not just what youD to. I wrote \"predict\" in here and it came out as \"guess\". That's a very informative Freudian slip. Seriously, it's easy to tell how smart people are in 10 minutes, you know, hit a few tennis balls over the net and do they hit them back at you or into the net. But the hard part was, and the most important part, was predicting how tough and ambitious they would become. There may be no one at this point who has more experience than me at doing this and I can tell you how much an expert can know about that. the the. The founders sometimes thought they knew. Some arrived feeling confident that they would ace Y Combinator just as they had aced every one of the few easy artificial tests they had faced in life so far. Others arrived wondering what mistake had caused them to be admitted and hoping that no one would discover it. But there is little to no correlation between these attitudes and how things turn out. 1 1 So if you want to start up one day, if you want to start a startup one day, what do you do now in college? There are only two things you need initially. An idea and co-founders. And the MO for getting them both is the same, which leads to our sixth, sixth and last counterintuitive point. The way to get startup ideas is not to try to think of startup ideas. I've written a whole essay on this and I'm not gonna repeat the whole thing here. But the short version is that if you make a conscious effort to try and think of startup ideas, you will, I think of ideas that are not only bad, but bad and plausible sounding. Meaning you and everybody else will be fooled by them and you'll waste a lot of time before realizing they're no good. The way to come up with good startup ideas is to take a step back. Instead of trying to make a conscious effort to think of startup ideas, turn your brain into the type that has startup ideas unconsciously. In fact, so unconsciously that you don't even realize at first that they're startup ideas. This is not only possible, Yahoo, Google,.. >> >> 3 3. With people you like and respect. That third part, incidentally, is how you get co-founders at the same time as the idea. The first time I wrote that paragraph, instead of learn a lot about things that matter, I wrote, become good at some technology. But that prescription, though sufficient, is too narrow. What was special about Brian Chesky and Joe Gebbia from Airbnb was not that they were experts in technology, they went to art school. They were experts in design and perhaps even more importantly, they were really good at organizing people and getting projects done. So you don't have to work on technology per se, so long as you work on things that stretch you. What kind of things are those? Now that is very hard to answer in the general case. History is full of examples of young people who are working on problems that no one else at the time thought were important, and in particular that their parents didn't think they were important. On the other hand, history is even fuller of examples of parents who thought they were important. t tTV switched from being Justin.TV to TwitchTV and they were going to broadcast people playing video games. I was like, what? But turned out to be a good business. Well, I know how I know real problems are interesting and I'm self-indulgent. I'm always interested in working on interesting things even if no one else cares about them. And I find it very hard to make myself work on boring things even if they're supposed to be important. My life is full of case after case where I worked on things the the.. the this is the actual meaning of the phrase begging the question. The hopelessly question begging advice that if you're interested in genuinely interesting problems, gratifying your interest energetically is the best way to prepare yourself for a startup. And for that matter, probably the best way to live. But although I can't explain in the general case what counts as an interesting problem, I can tell you about a large subset of them. If you think of technology as something that's spreading like a sort of fractal stain, is a to get yourself to the leading edge of some technology to, to as Paul Bukite put it live in the future. And when you get there, ideas that seem uncannily prescient to other people will seem obvious to you. You may not realize their startup ideas, but you'll know there's something that ought to exist. For example, back at Harvard, back in the mid 90s, a fellow grad student of my friends Robert and Trevor wrote his own voiceover IP software. It wasn't meant to be a startup. He never tried to turn it into one. He just wanted to talk to his girlfriend in Taiwan without paying for long distance calls. And since he was an expert on networks, it seemed obvious to him that the thing to do was turn the sound into packing. on the is the is education for its own sake. If you want to start a start-up, what you should do in college is learn powerful things. And if you have genuine intellectual curiosity, that's what you'll naturally tend to do if you just follow your own inclinations. The component of entrepreneurship, I can never quite say that word with a straight face, that really matters is domain expertise. Larry Page is Larry Page because he was an expert on search. And the way he became an expert on search was because he was genuinely interested in it, not because of some ulterior motive. At its best, starting a startup is merely an ulterior motive for curiosity. And you'll do it best if you introduce the ulterior motive at the end of the process. So here is the ultimate advice for young would-be startups. # # # >> >> Do you guys have the questions? >> Sure, we'll start with two questions online or we can start with audience. >> You guys are in charge, whatever you want to do. >> Okay, so to start with online questions, the most voted question today was- >> Do I have to repeat them by the way? >> Yeah. How can a non-technical founder most effectively contribute to a startup? >> How can a non-technical founder was an expert in the limo business, then actually the non-technical founder are probably doing most of the work, recruiting drivers and doing whatever else Uber has to do, right, and the technical founder would be just writing the iPhone app, which is probably less, well, iPhone and Android app, which is less than half of it. If it's a purely technology startup, the non-technical founder does sales and brings coffee and cheeseburgers to the programmer. Okay, next. Oh, audience, okay, audience, yes. >> Do you see any value in business goal for people who want to pursue entrepreneurship? >> Do I see any value in- >> Or if so, what value? >> I'm hoping to- >> Well, we probably won't have to get to the second question. >> [LAUGH] >> Which I suppose is the answer to your first question. >> Okay, so the question is, is there any value in business school if you're interested in entrepreneurship and if so what? So, basically no. I mean, it sounds undiplimatic, but the point, what business school was designed for is to teach people management, right? And management is a problem that you only have in a startup if you're sufficiently successful. So really, what you need to know early on to make a startup successful is and and 1 1 of the things I got wrong early on is that I advised people who were interested in starting a startup to go work for some other company for a few years before starting their own. But honestly, the best way to learn how to start a startup is just to try and start it. You may not be successful, but you'll learn faster if you just do it. So, not really. Business schools are trying really hard to do this, but honestly, they were designed to train the officer core of large companies, right? Which is what business seemed to be back when it was a choice of either the officer core of large companies or Joe's shoe store. And then there was this new thing, Apple, which started out as small as Joe's shoe store and then turns into this giant mega company. But they weren't designed for that world. And they're good at What about those first two or three people as Well, ideally, you're successful before you even hire two or three people, right? Didn't you say, Sam, that Airbnb took five months to hire their first employee? So ideally, you don't have even two or three people for quite a while. When you do, you can sort of, the first hires in a startup are almost like founders. They should be motivated by the same things. They can't be people, they can't be people you have to like manage, right? This is like that, this is not like the office or something like that. These have to be your peers really. You shouldn't have to manage them much. >> So is it just a big no-no, like someone has to manage no way they can be on the founding team? >> Well, never say never. I should repeat all these questions. So if someone has to manage no way they should be on the founding team. In the case where you're doing something where you need some sort of super advanced technical thing, and there's some Boffin, if you know that word, who knows this thing and nothing else in the world, including like how to wipe his mouth. Then it may be to your advantage to hire said boffin and wipe his mouth for him. But as a general rule, you want people who are sort of self-motivated early on. They should be just like founders. Yes, questions. In the far back. >> Do you think we're currently in a bubble? >> Do I think we're currently in a bubble? Okay, so I'll give you two answers to this question. >> >> # # the the # # the who knows, maybe between now and then the Chinese economy will have exploded and there's another giant disastrous recession, who knows, assume like 20. And so you're starting to see the rise of these labs attempts where they're gonna try to launch a bunch of stuff. I don't know a really stellar example yet, but do you see- >> You mean like, like IDEO? >> Like, no, like, like, like, IDEO lab, like, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, or, >> >> people So people are starting these things that are supposed to spin off startups, will it work? Quite possibly, quite possibly, if the right people do it. You can't do it yet though, because you have to do it with your own money. Yes, far back. >> Thank you so much. I hate to step into sort of a gender pitfall, but what advice do you have for female co-founders, as you're pursuing funding? >> Female co-founders when you're pursuing funding. Well, it probably is true that women have a harder time raising money, right? f f 1 1. So in fact, there was a point like a year or two ago when I tweeted this growth graph of this company and I didn't say who they were. But I knew it would start people asking. And it was actually a female founded startup that was having trouble raising money, but their growth graph was stupendous. And so I tweeted it knowing that like all these VCs would start asking me, who is that, right? And like growth graphs have no gender, right? So if they see the growth graph first, let them fall in love with that, right? So do well, which is good advice for startups generally. Yes? >> What would you learn in college right now? >> What what? >> What would you learn in college right now? >> What would I learn in college? Hm, hm. Literary theory? No, right? So I sort of got very excited about writing code. And you could do things with, you could do, you could write real programs in your bedroom. You can't like build real linear accelerators. Maybe you can. So maybe, maybe physics. I feel kind of, I always, I sort of look, I notice I sort of look logingly at physics. So maybe, but I don't know if that's, what am I saying? I'm saying, I was about to say, I don't know if that's going to be helpful starting a startup. I've just told you to follow your own curiosity. Who cares if it's helpful? It will turn out to be helpful. Questions? >> >>. So, actually many parents, many startup founders who have kids have made that point explicitly. It causes you to focus because you have no choice. Let's see, but that's not, I wouldn't actually recommend having kids just to make you more focused. So, let's see. to to read them and I knew if I read them badly we would get bad start-ups so I tried really hard to read them well, right? And so I set up this situation that forced me to work. The other kind of work I do is like writing essays and I do that involuntarily. I'm like walking down the street and the essay starts writing itself in my head. And so really I either force myself to work on less exciting things or I can't help working on exciting things and I don't have any useful techniques for making myself efficient. Sorry. If you work on things you like, you don't have to force yourself to be efficient. Yes? >> When is a good time to turn a side project into a startup? You will know, right? >> What do you mean the side project? >> It starts, you, when you, okay, so the question is when do you turn a startup into a side project into a real startup? You will know that it's becoming a real startup when it takes over an alarming percentage of your life, right? Like when you startup is doing extremely well. But I feel like in a lot of cases, it's just a bit of a gray line where it's like, you know, you have some users but maybe not. It's explosive build, chart isn't up to the right. How, what would you do, or what would you recommend doing in those situations, considering you're allocating time and resources? How do you balance and. >> Okay, when a startup is sort of growing but not much, didn't you tell them they were supposed to redo things that don't scale? >> Yeah. >> You, sir, have not done the readings. >> >>. But it's about exactly that problem. Yes, back there. >> What kind of startup should not go through incubation, in your opinion? >> What kind of, do you mean, do you mean the incubation LLYC? >> No, yeah, YC or- >> What kind of startup should not go through YC? Definitely any that will fail. >> [LAUGH] >> And, or if you'll succeed but you're an intolerable, intolerable That also Sam would probably sooner do without. Short of that, I cannot think of any because a large percentage, founders are often surprised by how large a percentage of the problems that startups have are the same regardless of what type of thing they're working on. And those tend to be the kind of problems that YC helps with to learn a lot about something that matters. or the >> >> problems which is whether you find working on boring things intolerable, right? And there are known boring things like literary theory and working in middle management in some large company. So if you could tolerate those things, then you must not, you must either have stupendous self-discipline or you don't have a taste for genuinely interesting problems. And vice versa, yes. >> One more question. >> Okay, one more question, it better be good. >> I was just wondering how you like Snapchat, like makes money with clients to do certain locations. >> Snapchat? What do I know about Snapchat? We didn't fund them. Can I have another question? All right, go ahead. >> So you're talking about hiring people in the way, but it seems like that can lead to a monoculture. There are a lot of benefits, it might be a monoculture. And how do you deal with the blind spots that arise? Starting a startup is something where many things will be going wrong. You can't expect it to be perfect. And the advantages of hiring people that you know and like are far greater than the small disadvantages of having somebody else."}