{"text":" >> >> Alright, good afternoon. Today's speaker is Peter Thiel. Peter was the founder of PayPal and Palantir and Founders Funds and has invested in most of the tech companies in Silicon Valley. And he's going to talk about strategy and competition. Thank you for coming, Peter. >> Awesome, thanks. Sam, thanks for inviting me, thanks for having me. I sort of have a single, I'd say, that I'm completely obsessed with on s s s s... It was 195 billion in domestic revenues in 2000, 2012. Google had just north of 50 billion. And this, and so, and certainly, sort of on some intuitive level, if you said, if you were given a choice and said, well, do you want to get rid of air, all air travel, or do you want to get rid of your ability to use search engines, the intuition would be that air travel is something that's more important than search. And this is, of just the domestic numbers. If you looked at this globally, airlines are much, much bigger than, than, than, than, than, than searcher, than Google is. But, but the profit margins are quite a bit less. You know, they were marginally profitable in 2012. I think the entire hundred year history of the airline industry, the cumulative profits in the US have been approximately zero. The companies make money, they episodically go bankrupt, they get recapitalized, and you sort of cycle and repeat. And this is reflected in, you know, the, the combined market capitalization of the, of the airline industries may be something of the US airline industry, something like a quarter that of Google. So, so you have, you know, there are sort of, there's some pros and cons to the world of perfect competition. On a high level it's always, this is what you study in Econ One. It's always, it's easy to model, which I think is why Econ professors like talking about perfect competition. It somehow is efficient, especially in a world where things are static, because you have all the consumer surplus gets captured by everybody. And, and politically it's what, what we're, s s >> >> longer term businesses, you have more capital. And if you get a creative monopoly for inventing something new, I think it's symptomatic of having created something really valuable. And so I do think this, the sort of the extreme binary view of the world I always articulate is that there are exactly two kinds of businesses in this world. There are businesses that are perfectly competitive and there are businesses that are monopolies. And there's shockingly little that is >> >> s s s nopoli. So, anyone who has a monopoly will pretend that they're in incredible competition. And on the other end of the spectrum, if you are incredibly competitive, and if you're in some sort of business where you will never make any money, you will be tempted to tell a lie that goes in the other direction where you will say that you're doing something unique that is somehow less competitive than the union of these vastly different markets and the non-monopolist describes it as the intersection. So that in effect, if you're a non-monopolist, you will rhetorically describe your market as super small. You're the only person in that market. If you have monopoly, you will describe it as super big and there's lots of things the the. Capitalism and competition are antonyms. Capitalism accumulates capital. World of perfect competition is a world where all the capital gets competed away. So you're opening a restaurant business. No one wants to invest because you just lose money. So you have to tell some idiosyncratic narrative and you will say something like, well, we're the only British food restaurant in Palo Alto. So it's British, Palo Alto, and of course that's too small a market because people may be able to drive all the way to Mountain View or even Menlo.com. t t. That's a sort of a fictitiously narrow market. There's sort of a Hollywood version of this where the way movies always get pitched is, you know, okay, it's like a college football star, you know, joins an elite group of hackers to catch the shark that killed his friend. Sorry. And so that's, now that is a movie that has not yet been made. s s is it generally does not work. The something of somewhere is really mostly just the nothing of nowhere. It's like the Stanford of North Dakota. One of a kind, but it's not Stanford. So let's look at the opposite. The opposite lie is if you are, let's say, wow, it's like, it has this huge market share that's really, really crazy. It's like an incredible monopoly. It's much bigger than, it's much, a much more robust monopoly than Microsoft ever had in the 90s. Maybe that's why it's making so much money. But if you say it's an advertising market, you could say, well, there's search advertising is 17 percent. So a tiny part of this much larger market. Or if you don't want to be an advertising company, you can always say that you're a technology company. And so, sorry, let me just see. And so, and the technology market is something like a $1 trillion market. And the narrative that you tell is Google in the technology market is, well we're competing with all the car companies with our self-driving cars. We're competing with Apple on TVs and iPhones. We're competing with Facebook. We're competing with Microsoft on office products. We're competing with Amazon on cloud services... the of the the s s to to >> >>. So,. You know, a second sort of, there's sort of several different characteristics of these monopoly businesses that I like to focus on. And there's probably no, no sort of single formula to it. And I, I always think that that in technology, there's always a sense that, you know, the history of technology is such that every, every moment happens only once. And so, you know, the next Mark Zuckerberg won't build a social network. The next Larry Page won't be building a search engine. The next Bill Gates won't be building an operating system. And if you're copying these people, you're not learning from them. And so there is always these very unique businesses that are doing something that's not been done before end up having the potential to be a monopoly. >> >> t t was was using checks to send money on eBay, took seven to ten days to clear. PayPal could do it more than ten times as fast. So you want to have some sort of very, very powerful improvement in some order, maybe an order of magnitude improvement on some key dimension. Of course, you know, if you, if you actually come with something totally new it's, it's, it's just like an infinite improvement. And then there's this thing of branding which is sort of like just this idea that gets lodged in people's brains. I never quite understand how branding works. So I never invest in companies where it's just about branding. But it is, I think, a real phenomenon that creates real value. I think one of the things, I'm gonna come back to this a little bit towards the end. But one of the things that's very striking is that software businesses, s s s the the the growth rates much higher than the discount rate and so most of the value exists far in the future. I did this exercise at PayPal in March of 2001. We had been in business for about 27 months and we sort of had, you know, the growth rate was 100% a year. We were discounting future cash flows by about 30% and it turned out that about three quarters of the value of the business as of 2001 came from cash flows in years 2011 and beyond. and and, Facebook, any emerging Internet companies, all the ones in Y Combinator. The math tells you that three quarters, 80, 85% of the value is coming from cash flows in years 2024 and beyond. It's very, very far in the future. And so one of the things that we always overvalue in Silicon Valley is growth rates and we undervalue durability. Because growth is something you can measure in the here and now and you can always track that very precisely. The question of whether a company is still going to be around a decade from now, that's actually what dominates the value equation and that sort of is a much more qualitative sort of a thing. And so if we went back to this idea of these things going to last over time. And so there's a time dimension to all these characteristics. So network effects often have a great time element where as the network scales, the network effects actually get more robust. And so if you have a network effect business, that's often one that can become a bigger and stronger monopoly over time. Proprietary technology is always a little bit of a tricky one. So you want something that's ordered magnitude better than s s the the. It's actually not that good for your business typically. And then economies of scale, we already talked about. So, so I think, anyway, so I think this last mover thing is, is very critical. I'm always tempted, you know, that, I don't want to overdo the chess analogies, but, you know, the first mover in chess is someone who plays white. White is about a one-third of a pawn advantage. So there's a small advantage to going first. You want to be the last mover who wins the game, and so there's the capablanca world champion, chess champion capablanca line. You must begin by studying the end game. And I do think that's why, I wouldn't say that's the only thing you should study. I think this sort of perspective of asking these questions, why will this still be the leading company 10, 15, 20 years from now, is a really critical one to try to think through. Wright brothers, you fly the first plane, you don't make any money. And so I think there is sort of a structure to these industries that's very important. And I think the thing that's actually rare are the success cases. Most of the, so it's actually, when you really think about the history in this 250 year sweep, it's, Y is almost always 0%. It's always zero in science. It's almost always in technology. And so it's very rare where people made money. You know, the early, the late 18th century, s s t t the landed aristocracy. The workers didn't, you know, the workers didn't make that much. The capitalists didn't make that much either. It was all competed away. There were hundreds of people running textile factories. It was an industry that just the structure of the competition prevented people from, from making any money. And so I think there are, in my mind, there probably are only two broad categories in the entire history of the last 250 years where people have actually come up with new things and made money doing so. t t >> >> is is this a rationalization to obscure the fact that Y equals 0% and the scientists are operating in this sort of world where all the innovation is effectively competed away and they can't capture any of it directly. And then the software distortion that often happens is because people are making such vast fortunes in software, we infer that this is the most valuable thing in the world being done full stop. And so if people at Twitter may >> >> and and and and there is sort of this, this story where some people have made vast fortunes because they were in industries with the right structure and other people made nothing at all because because they were in these sort of very competitive things and we shouldn't just rationalize that way. I think it's worth who can't compete. And I want us to really rethink and revalue this and consider whether it's possible that competition itself is off. It's not just the case that we don't understand this monopoly competition dich a psychological blind spot where we find ourselves very, very attracted to competition in one form or another. We find it reassuring if other people do things. The word ape already in the time of Shakespeare meant both primate and imitate. And there is something about human nature that's deeply memetic, imitative, ape-like, sheep-like, lemming-like, curd-like. And it's this very, very problematic thing that we need to, and >> >> the the. There's always sort of a non-competitive characterization where I think most of the people in this room had machine guns. They were competing with people with bows and arrows. So it wasn't exactly a parallel competition when you were in junior high school and high school. There's always a question, does the tournament make sense as you keep going? And this is and so there is always this question, if people go on to grad school or post-doctoral educations, does the intensity of the competition really make sense? There's the classic Henry Kissinger line that describing his fellow faculty at Harvard that the battles were so ferocious because the stakes were so small, describing sort of academia. And you sort of think on one level, this is a description of insanity. Why would people fight like crazy when the stakes are so small? But it's also, I think, simply a function of the logic of the situation. When it's really hard to differentiate yourself from other people, when the objective differences really are small, then you have to compete ferociously to maintain a difference of one sort or another that's often more imaginary than real. There's always sort of a personal version of this that I tell where I was sort of hyper, hyper tracked. I, you know, my eighth grade junior high school yearbook, one of my friends wrote in, you know, I know you'll get into Stanford in four years as a sophomore. Sort of went into Stanford four years later at the end of high school, went to Stanford Law School, you know, ended up at a big law firm in New York where from the outside everybody wanted to get in, on the inside everybody wanted to leave. And, and you had, and it was this very strange dynamic where after I sort of realized this was maybe not the best idea, and I left after seven months and three days, you know, one of the people down the hall from me told me,. >> [APPLAUSE] >> Time for, you want to take a few questions or. >> [INAUDIBLE] >> Oh, yes, people want to take, I'll take a few questions, we have a few minutes time. Yeah, go ahead. >> Since, as you mentioned earlier, often monophiles and perfect competition often look similar because the narratives people tell will be narratives we tell ourselves. Do you have any ways to easily determine the difference when you're looking at an idea or evaluating your own idea? >> Well, I'd say the question I always try to focus on is what is the actual market? So not what's the narrative of the market, because you can always tell a fictional story about a market that's much bigger or much smaller. But what is the real objective market? So it's always, yeah, you always try to figure it out, and you realize people have incentives to powerfully distort these things. Yeah? >> So which of the aspects of monologies that you mentioned would you say that software problems like Google or BigSapp had? >> Well, they have network effects with the ad network. They had proprietary technology that gave them the initial lead because they had the page rank algorithm which was sort of an order of magnitude better than any other search engine. You have economies of scale because of the need to store all these different sites and at this point you have brands. So Google has all four. Maybe the proprietary technology is somewhat weaker at this point, but definitely it had all four and maybe three and a half out of four now. Yeah. >> How does this apply to volunteer and second, what's it like? >> The second is what? >> What's with the iPhone? >> That a sort of a set of companies that are doing different copycat payment systems on mobile phones. There's Square, there's PayPal. They just have sort of different shapes. That's how they differentiate themselves. One is a triangle, one is a square. And so, you know, maybe at some point the apes will run out of shapes or something like that. But I think, now, we started with focus on the intelligence community, which is small sub-market. You had a proprietary technology that used a very, very different approach where it was focused on the human computer synthesis rather than the substitution, which I think is the dominant paradigm. So there's a whole set of things I would say on the market approach and the proprietary technology. Yes. >> We have design thinking methodology and we start up thinking which is used to mitigate risk by not creating things that people don't want. But how do young innovators have inspiration to create complex systems that last? >> Can you repeat the question? >> Yeah, so the question is what I think about lean startups iterative easily deterred by what other people thought or told them to do. So I do think we're way too focused on iteration as a modality and not enough on trying to have a virtual ESP link It may still be a very high risk track in the sense that maybe you have a high risk of not doing something meaningful with your life. So we have to think about risk in these very complicated way. I think risk is sort of this very complicated concept. Yes? >> I was just talking about the last group of advantage, but then doesn't that imply that there's already competition between the other one, chess piece, long chess board? >> Yeah, so say Google was not the first search engine, there were other search engines before, but on one dimension they were dramatically better than everybody else. So they were the first one with PageRank, with sort of an automated approach. Facebook was not the first social networking site. My friend Reid Hoffman started one in 1997. They called it SocialNet, so they already had the name, Social Networking, in the name of their company, seven years before Facebook.. >> I have one more question. >> Okay, one more question. Let's take one here. >> If you're theoretically someone who worked at Golden Sac State College and left out at six months and is now studying computer science at Stanford, How would you recommend rethinking sort of that competitive thing that you're testing out? >> You know, I don't have a, I don't have a great, I'm not great at the psychotherapy stuff, so I don't quite know how to, I don't quite know how to solve this. There are these, you know, there are these very odd studies they've done on people who go to business school. There's one they've done at Harvard Business School where it's sort of the anti Asperger personality where you have people who are super extroverted, generally have low convictions, few ideas. And you have sort of a hot house environment, you put all these people in for two years. And at the end of it, they systematically end up, the largest cohort systematically ends up >> >> Valley or Tech except for 99, 2000 when they timed the dot com bubble peeking perfectly. They did and then, you know, 05 to 07 was housing, private equity stuff like this. So, so I do think I do think this tendency for us to see competition as validation is is very deep. I don't think there's some, any sort of easy psychological formula to to avoid it. So I don't, I don't quite know how to what all should work to overcome. Thank you very much."}